Repository: Gaoyifei1011/GetStoreApp
Catalog: GetStoreApp/Strings/*/WinGet.resw
Source language: en_us
Languages: ar, zh_hans

# AppCurrentVersionToolTip
source: Current version:{0}
ar: الإصدار الحالي:
zh_hans: 当前版本：{0}

# AppNameToolTip
source: App name:{0}
ar: اسم التطبيق:
zh_hans: 应用名称：{0}

# AppNewestVersionToolTip
source: The newest version:{0}
ar: أحدث إصدار:
zh_hans: 最新版本：{0}

# AppPublisherToolTip
source: Publisher:{0}
ar: الناشر:
zh_hans: 发布者：{0}

# CancelInstall
source: Cancel the installation
ar: إلغاء التثبيت
zh_hans: 取消安装

# CopyInstallText
source: Copy install command
ar: نسخ أمر التثبيت
zh_hans: 复制安装命令

# CopyUnInstallText
source: Copy uninstall command
ar: نسخ أمر إلغاء التثبيت
zh_hans: 复制卸载命令

# CopyUpgradeText
source: Copy upgrade command
ar: نسخ أمر الترقية
zh_hans: 复制升级命令

# DownloadedProgressToolTip
source: Download progress: {0} completed
zh_hans: 下载进度：已完成{0}%

# DownloadFromGithub
source: Download from Gtihub
ar: تنزيل من GitHub
zh_hans: 从 Gtihub 中下载

# DownloadFromGithubToolTip
source: Download from Github (official, preview, developer, etc.)
ar: تنزيل من GitHub (رسمية، معاينة، مطور، إلخ)
zh_hans: 从 Github 中下载（正式版、预览版、开发版等）

# DownloadFromMicrosoftStore
source: Download from the Microsoft Store
ar: تنزيل من متجر Microsoft
zh_hans: 从微软商店中下载

# DownloadFromMicrosoftStoreToolTip
source: Download from Microsoft Store (official version)
ar: تنزيل من متجر Microsoft (الإصدار الرسمي)
zh_hans: 从微软商店中下载（正式版）

# DownloadingToolTip
source: Downloading...
zh_hans: 下载中...

# FinishedToolTip
source: Finished
zh_hans: 已完成

# InitializeFailedDescription
source: Unfortunately, the WinGet package manager initialization exception occurred and the application detected that the WinGet package manager was not installed on your system.
ar: للأسف، حدث استثناء في تهيئة مدير حزم WinGet، واكتشفت التطبيق أن مدير حزم WinGet لم يتم تثبيته على نظامك.
zh_hans: 很不幸的事情发生了，WinGet 程序包管理器初始化异常，应用检测到您的系统没有安装 WinGet 程序包管理器。

# InitializeFailedTitle
source: Welcome to Get Store application WinGet Package Manager
ar: مرحبًا بك في تطبيق Get Store مدير حزم WinGet
zh_hans: 欢迎使用获取商店应用 WinGet 程序包管理器

source: Install
ar: تثبيت
zh_hans: 安装

source: Installed apps
ar: التطبيقات المثبتة
zh_hans: 已安装应用

# InstalledAppsCountEmpty
source: There is no installed apps
ar: لا توجد تطبيقات مثبتة
zh_hans: 没有已安装的应用

# InstalledAppsCountInfo
source: There are {0} installed apps
ar: يوجد {0} تطبيقات مثبتة
zh_hans: 共有{0}个已安装的应用

# InstalledAppsEmptyDescription
source: The application record is empty. Go ahead and install the application you want to use
ar: سجل التطبيق فارغ. تابع لتثبيت التطبيق الذي تريد استخدامه
zh_hans: 应用记录为空，快去安装需要使用的应用吧

# InstalledAppsPlaceHolderText
source: Search the installed apps
ar: ابحث عن التطبيقات المثبتة
zh_hans: 搜索已安装的应用

# InstalledAppsSearchEmptyDescription
source: The application you searched for has not been found, please change the search criteria and try again
ar: لم يتم العثور على التطبيق الذي بحثت عنه، يرجى تغيير معايير البحث والمحاولة مرة أخرى
zh_hans: 您搜索的应用暂未找到，请更改搜索条件后再进行尝试

# InstallingAppsListEmpty
source: There are currently no download and installation tasks
ar: لا توجد مهام تنزيل وتثبيت حاليًا
zh_hans: 当前暂无下载和安装任务

# InstallingToolTip
source: Installing...
zh_hans: 安装中...

# InstallStateToolTip
source: Install state: {0}
zh_hans: 安装状态：{0}

# InstallWithCmd
source: Install with command
ar: تثبيت باستخدام الأمر
zh_hans: 使用命令安装

# Introduce
source: Introduction to WinGet Package Manager:
ar: مقدمة إلى مدير حزم WinGet:
zh_hans: WinGet 程序包管理器介绍：

# IntroduceContent1
source: Windows Package Manager is a comprehensive package manager solution that consists of a command line tool and set of services for installing applications on Windows 10 and Windows 11.
ar: مدير حزم Windows هو حل شامل لإدارة الحزم يتكون من أداة سطر الأوامر ومجموعة من الخدمات لتثبيت التطبيقات على Windows 10 وWindows 11.
zh_hans: Windows 程序包管理器是一个综合的程序包管理器解决方案，由一个命令行工具和一组用于在 Windows 10 和 Windows 11 上安装应用程序的服务组成。

# IntroduceContent2
source: The winget tool enables users to discover, install, upgrade, remove and configure applications on Windows 10 and Windows 11 computers.
ar: تتيح أداة winget للمستخدمين اكتشاف وتثبيت وترقية وإزالة وتكوين التطبيقات على أجهزة Windows 10 وWindows 11.
zh_hans: 用户可以在 Windows 10 和 Windows 11 计算机上使用 winget 工具来发现、安装、升级、删除和配置应用程序。

source: Learn more
ar: تعرف على المزيد
zh_hans: 了解更多

# LearnMoreToolTip
source: Learn more about the WinGet package manager description
ar: تعرف على المزيد حول وصف مدير حزم WinGet
zh_hans: 了解更多有关 WinGet 程序包管理器的描述信息

# LoadingInstalledApps
source: Please wait while loading the list of installed applications...
ar: يرجى الانتظار أثناء تحميل قائمة التطبيقات المثبتة...
zh_hans: 正在加载已安装应用列表，请稍候...

# LoadingUpgradableApps
source: Please wait while loading the list of upgradable applications...
ar: يرجى الانتظار أثناء تحميل قائمة التطبيقات القابلة للترقية...
zh_hans: 正在加载可升级应用列表，请稍候...

# NotSearchedTip
source: Go ahead and get the apps you want to install. The apps you search for will be displayed here
ar: تابع للحصول على التطبيقات التي تريد تثبيتها. ستظهر التطبيقات التي تبحث عنها هنا
zh_hans: 快去获取想要安装的应用吧，您搜索到的应用将会显示在此处

source: Operation
ar: عملية
zh_hans: 操作

# PostInstallToolTip
source: Wait for additional actions after the installation is completed
zh_hans: 等待安装完成后的其他操作

# QueuedToolTip
source: Waiting...
zh_hans: 等待中...

source: Refresh
ar: تحديث
zh_hans: 刷新

# RefreshToolTip
source: Refresh installed application data
ar: تحديث بيانات التطبيق المثبتة
zh_hans: 刷新已安装应用数据

source: Search apps
ar: ابحث عن التطبيقات
zh_hans: 查找应用

# SearchAppsEmptyDescription
source: Unable to find a package that matches the entered criteria, please change the search criteria and try again
ar: غير قادر على العثور على حزمة تتطابق مع المعايير المدخلة، يرجى تغيير معايير البحث والمحاولة مرة أخرى
zh_hans: 找不到与输入条件匹配的程序包，请更改搜索条件后再进行尝试

# SearchAppsPlaceHolderText
source: Search apps
ar: ابحث عن التطبيقات
zh_hans: 搜索应用

# SearchedAppsCountEmpty
source: No apps were searched
ar: لم يتم البحث عن أي تطبيقات
zh_hans: 没有搜索到任何应用

# SearchedAppsCountInfo
source: There are {0} searched apps
ar: يوجد {0} تطبيقات تم البحث عنها
zh_hans: 已搜索到{0}个应用

# SearchingApps
source: The application is searching, please wait...
ar: التطبيق يبحث، يرجى الانتظار...
zh_hans: 应用正在搜索中，清稍候...

# SortMode
source: Sorting mode
ar: وضع الفرز
zh_hans: 排序方式

# SortRule
source: Sorting rules
ar: قواعد الفرز
zh_hans: 排序规则

source: Stop download
ar: إيقاف التنزيل
zh_hans: 停止下载

source: Task manager
ar: مدير المهام
zh_hans: 任务管理

source: Uninstall
ar: إلغاء التثبيت
zh_hans: 卸载

source: Unknown
ar: غير معروف
zh_hans: 未知

source: Update
ar: تحديث
zh_hans: 升级

source: Upgradable apps
ar: التطبيقات القابلة للترقية
zh_hans: 可升级应用

# UpgradableAppsCountEmpty
source: There is no upgradeable apps
ar: لا توجد تطبيقات قابلة للترقية
zh_hans: 没有可升级的应用

# UpgradableAppsCountInfo
source: There are {0} upgradable apps
ar: يوجد {0} تطبيقات قابلة للترقية
zh_hans: 共有{0}个可升级的应用

# UpgradableAppsEmptyDescription
source: All of your applications are up to date
ar: جميع تطبيقاتك محدثة
zh_hans: 您的所有应用已经是最新版本了

source: View more options
ar: عرض المزيد من الخيارات
zh_hans: 查看更多选项

# AppVersionToolTIp
source: App version:{0}
ar: إصدار التطبيق:
